# Задание 1
# example = eval(input('Введете пример: '))
# print(example)

# Задание 2
# import random

# lst = []
# for i in range(0, 10):
#     lst.append(random.randint(-10, 50))

# positive_num = 0
# negative_num = 0
# zero = 0

# for i in lst:
#     if i > 0:
#         positive_num += 1
#     elif i < 0:
#         negative_num += 1
#     else:
#         zero += 1

# print(lst)
# print('Максимальное число:', max(lst))
# print('Минимальное число:', min(lst))
# print('Положительные числа: ', positive_num)
# print('Отрицательные числа: ', negative_num)
# print('Нули:', zero)
