# Задание 1
# n1 = input('Введите 1ое число: ')
# n2 = input('Введите 2ое число: ')
# n3 = input('Введите 3ое число: ')
# print('Сформированное число:', int(n1 + n2 + n3))

# Задание 2
# num = int(input('Введите четырехзначное число: '))
# n1 = num // 1000
# n2 = (num // 100) % 10
# n3 = (num // 10) % 10
# n4 = num % 10
# print('Произведение чисел:', n1 * n2 * n3 * n4)

# Задание 3
# n = int(input('Введите количество метров: '))
# print('В сантиметрах:', n / 100)
# print('В дециметрах:', n / 10)
# print('В миллиметрах:', n / 1000)
# print('В милях:', n / 0.000621371)

# Задание 4
# a = int(input('Введите основание треугольника: '))
# h = int(input('Введите высоту треугольника: '))
# print('Площадь треугольника равна:', 0.5 * a * h)

# Задание 5
# num = int(input('Введите четырехзначное число: '))
# n1 = num // 1000
# n2 = (num // 100) % 10
# n3 = (num // 10) % 10
# n4 = num % 10
# print('Перевернутое число:', str(n4) + str(n3) + str(n2) + str(n1))
