# Задание 1
# n1 = int(input('Введите 1-ое число: '))
# n2 = int(input('Введите 2-ое число: '))
#
# for i in range(n1, n2):
#    if i % 7 == 0:
#        print(i)

# Задание 2
# n1 = int(input('Введите 1-ое число: '))
# n2 = int(input('Введите 2-ое число: '))
# for i in range(n1, n2 + 1):
#     print(i, end=' ')
# print()
#
# for i in range(n2, n1 - 1, -1):
#     print(i, end=' ')
# print()
#
# for i in range(n1, n2):
#     if i % 7 == 0:
#         print('Числа кратные семи:', i)
#
# count = 0
# for i in range(n1, n2):
#     if i % 5 == 0:
#         count += 1
# print('Количество чисел кратные 5:', count)

# Задание 3
# n1 = int(input('Введите 1-ое число: '))
# n2 = int(input('Введите 2-ое число: '))
# for i in range(n1, n2 + 1):
#     if i % 3 == 0 and i % 5 == 0:
#         print('Fizz Buzz')
#     elif i % 3 == 0:
#         print('Fizz')
#     elif i % 5 == 0:
#         print('Buzz')
#     else:
#         print(i)
