# Задание 1
# n1 = int(input('Введите 1-ое число: '))
# n2 = int(input('Введите 2-ое число: '))
#
# numEven = 0
# numOdd = 0
# num_9 = 0
# j = 0
# k = 0
# n = 0
# for i in range(n1, n2 + 1):
#    j += 1
#    if i % 2 == 0:
#        numEven += i
#        j += 1
#    else:
#        numOdd += i
#        k += 1
# for i in range(n1, n2 + 1):
#    if i % 9 == 0:
#        num_9 += i
#        n += 1
#
# print(numEven)
# print('Среднее арифметическое:', numEven / j)
# print(numOdd)
# print('Среднее арифметическое:', numOdd / k)
# print(num_9)
# print('Среднее арифметическое:', num_9 / n)

# Задание 2
# a = int(input('Введите длину линии: '))
# b = input('Введите символ для заполнения: ')
#
# for i in range(a):
#     print(b)

# Задание 3
# num = int(input('Введите число: '))
# while num != 7:
#     if num > 0:
#         print('Number is positive')
#     elif num < 0:
#         print('Number is negative')
#     else:
#         print('Number is equal to zero')
#     num = int(input('Введите число: '))
# print('Good bye!')

# Задание 4
# num = int(input('Введите число: '))
# c = 0
# max = 0
# min = num
# while num != 7:
#     c += num
#     if num > max:
#         max = num
#     elif num < min:
#         min = num
#     num = int(input('Введите число: '))
# print('Максимальное:', max)
# print('Минимальное:', min)
# print('Сумма чисел:', c)
# print('Good bye!')
